package com.example.slo.controller;

import com.example.slo.config.Log4j2Config;
import com.example.slo.config.OpensearchConfig;
import com.example.slo.data.Data;
import com.fasterxml.jackson.databind.ObjectMapper;
import lombok.extern.log4j.Log4j2;
import org.apache.logging.log4j.LogManager;
import org.apache.logging.log4j.Logger;
import org.opensearch.client.opensearch.core.SearchResponse;
import org.opensearch.client.opensearch.core.search.Hit;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Component;
import org.springframework.web.bind.annotation.GetMapping;
import org.springframework.web.bind.annotation.PostMapping;
import org.springframework.web.bind.annotation.RequestParam;
import org.springframework.web.bind.annotation.RestController;

import java.util.List;

@RestController
@Log4j2
@Component
public class TestController {

    private final OpensearchConfig opensearchConfig;
    @Autowired
    public TestController(OpensearchConfig opensearchConfig) {
        this.opensearchConfig = opensearchConfig;
    }


    private static final Logger logger = LogManager.getLogger(TestController.class);
    private static final ObjectMapper objectMapper = new ObjectMapper();

    String a = " [\n" +
            "            {\n" +
            "              \"content\": \"‚‚‚“¤  ’  ‘  “1— ̃  ‰‚‚‚ ‚‘  “¤ ’‘–”\u00AD“  ...Œ・ƒ‚ƒ‹ƒƒ‹ •‚ ̄ƒ‚ƒ‹ƒƒ‹ •‚ ̄                      ‡      S=1:1,000北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名全体平面図平成18年11月36葉之内1松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体CFDntAttCFAt\",\n" +
            "              \"page\": 1\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:100北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台構造一般図(その1)平成18年11月36葉之内3橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 2\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 3\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その1)平成18年11月36葉之内5橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 4\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その2)平成18年11月36葉之内6橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 5\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その3)平成18年11月36葉之内7橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 6\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その4)平成18年11月36葉之内8橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 7\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 8\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 9\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 10\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 11\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 12\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 13\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 14\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"4-43-3法面工平面図S=1:1004-43-3法面工施工対象範囲S=1:100北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名法面工平面図(A2橋台)平成18年11月36葉之内16橋梁下部(法覆工/A2斜面)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 15\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"400070001234400070001234中心部下流側4-4400070001234上流側3-35 55断面図S=1:200100001000010000法面工断面図(A2橋台) 36葉之内17北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体橋梁下部(法覆工/A2斜面)\",\n" +
            "              \"page\": 16\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 17\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 18\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"φ10040.4200φ45ロックボル工詳細図(1)ロックボルト(SD345)部品詳細図1:2ナット(D22)スペーサー(D22)角座金ワッシャ- ※防錆材360g入りヘッドキャップ(アルミ製)シ-スロックボルト材料表(1本当たり)(亜鉛メッキ(2種HD Z55)) (亜鉛メッキ(2種HD Z55))※2箇所取付け個14t×150×150 φ45角座金個φ45×200mmシース2個スペーサー1個球面ワッシャ個D22用ナット本ネジ節棒鋼備考数量単位規格項目1111D22 L=4400mmロックボルト工構造図1:3 100個φ100ヘッドキャップ1(SD345 D22 L=4400)箱抜VP75(外径89mm)φ65吹付枠厚(t=30cm)頭部余長ロックボルトD22(SD345)亜鉛メッキ(2種HD Z55)グラウトスペーサーD22用防錆材込みφ65シース防錆材角座金ワッシャーヘッドキャップ(アルミ製)ナット(D22用)M76SUS M8OリングM76Oリング127 φ45φ32φ5435φ324014φ45φ100150φ76φ45φ4525φ76φ42φ32M76150150亜鉛メッキ(2種HD Z55)亜鉛メッキ(2種HD Z55)亜鉛メッキ(2種HD Z55)ロックボルト工詳細図(1)36葉之内20北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 19\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"φ10043.9200φ45ロックボル工詳細図(2)ロックボルト(SD345)部品詳細図1:2ナット(D25)スペーサー(D25)角座金ワッシャ- ※防錆材360g入りヘッドキャップ(アルミ製)シ-スロックボルト材料表(1本当たり)(亜鉛メッキ(2種HD Z55)) (亜鉛メッキ(2種HD Z55))個15t×150×150 φ45個φ45×200mmシース2個スペーサー1個球面ワッシャ個D25用ナット本ネジ節棒鋼備考数量単位規格項目1111ロックボルト工構造図1:3 100個φ100ヘッドキャップ1(SD345 D25 L=5400)箱抜VP75(外径89mm)φ655000吹付枠厚(t=30cm)頭部余長ロックボルトD25(SD345)亜鉛メッキ(2種HD Z55)グラウトスペーサーD25用防錆材込みシース防錆材角座金ワッシャーヘッドキャップ(アルミ製)ナット(D25用)M76SUS M8OリングM76Oリングφ45φ32φ5438 5015φ45150150φ100150φ76φ45φ4525φ76φ42φ32M765400φ65130亜鉛メッキ(2種HD Z55)亜鉛メッキ(2種HD Z55)亜鉛メッキ(2種HD Z55)角座金※2箇所取付けロックボルト工詳細図(2)36葉之内21北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 20\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 21\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"下島大橋一般図側面図平面図上部構造標準断面図下部構造断面図P1(P2)橋脚A2橋台A1橋台中間支点部支間中央部36葉之内23北陸地方整備局利賀ダム工事事務所松谷橋下部その2他工事下島大橋一般図平成18年11月図示図面番号工事名年月日縮尺図面名事務所名会社名斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 22\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 23\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 24\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 25\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"ロックボルト工施工延長15.0m支圧板吹付枠工(CF300×300-1500×1500)補強材D25,3.5m,n=8段法面積A=167m2ロックボルト工施工延長30.0m支圧板吹付枠工(CF300×300-1500×1500)補強材D25,3.5m,n=5段法面積A=180m2流路工全長108mモルタル吹付けt=10cm通水断面φ500半円相当TR.60TR.61TR.62TR.63TR.64TR.6550+00R=5R=5455.99427.12390.41401.25411.95412.86426.90411.52400.67421.44442.44445.66420.04424.11439.62431.51410.52421.67426.53439.61433.11465.29463.89470.42466.60470.06467.71457.48458.55455.58447.97472.17467.69472.67405400395445440450455430415410420425435475478.11NO.389478.83476.57475.62482.31484.89484.111038482.75481.03480.19480.27483.85481.79489.06488.81NO.390489.77483.93480.82474.47478.38476.56478.79478.22472.72477.26480.78490.90490.85492.09485490480493.92488.76486.49486.88BL2.04BL2.05 BL2.06BL2.08457.2444.8396.4432.9点名X座標Y座標標高基-1 51850.874 -12344.356基-2 51509.958 -12312.944T-1 51903.760 -12421.549TT-1 51931.490 -12441.666TT-2 51965.241 -12401.083TT-3 51955.975 -12354.2300.0 51951.937 -12435.4535.0 51955.957 -12438.42610.0 51959.976 -12441.40020.0 51968.016 -12447.34730.0 51976.055 -12453.29440.0 51984.095 -12459.24150.0 51992.134 -12465.18860.0 52000.174 -12471.13570.0 52006.494 -12478.88475.0 52009.655 -12482.75980.0 52012.815 -12486.63490.0 52017.300 -12495.57295.0 52019.543 -12500.041100.0 52021.786 -12504.509105.0 52024.028 -12508.9780.0-4.0m逃げ51948.721 -12433.0740.0-11.5m逃げ51942.692 -12428.6140.0-26.0m逃げ51931.034 -12419.99160.0-40.0m逃げ51974.892 -12440.13880.0-20.0m逃げ52025.456 -12502.133TT-1TT-20.0105.00.0-4.0m逃げ0.0-11.5m逃げ0.0-26.0m逃げAB501.187500.291477.322476.188481.676487.5510.05.010.020.030.040.050.060.0A60.0B70.080.0A75.080.0B90.095.0100.0105.0472.16474.55474.97477.50477.48477.34477.34477.14477.16477.14477.10477.10484.43484.43484.53484.47484.80484.79485.45464.82460.35453.13445.96439.63433.52426.90421.53419.89415.03408.53405.55399.41400.89398.69396.32393.51390.29389.68475470465460455450445440435430425420415410405400460465NoNoNoNo NoNoN0m20m縮尺1:25010mサウンディング位置凡例斜面対策工平面図S=1:250利賀川▽利賀ダムサーチャージ水位SWL=434.5m▽利賀ダム最低水位LWL=395.0m▽利賀ダム常時満水位NWL=411.0m↑施工範囲斜面対策工平面図36葉之内27北陸地方整備局利賀ダム工事事務所S=1:250事務所名会社名尺度図面番号図面名年月日工事名平成18年11月斜面対策(利賀湖面橋右岸側)松谷橋下部その2他工事護岸工鉄線蛇篭または盛土簡易吹付法枠工法面積A=1284m2300×100-1300×1300枠内植生基材吹付(t=5cm)簡易吹付法枠工300×100-1300法面積A=568m2枠内植生基材吹付工t=5cm仮設モルタル吹付工t=3cm吹付枠工CF200×200-1200法面積A=117m2枠内植生基材吹付工t=5cm植生基材吹付工t=5cm法面積A=107m2↓施工済範囲簡易吹付法枠工(仮設モルタル吹付部)法面積A=631m2300×100-1300×1300枠内植生基材吹付工t=10cm流路工法面積A=117m2モルタル吹付t=10cm通水断面φ500半円相当斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 26\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"1:200400.0S Co As CoCo395.01:200410.0420.0430.0440.0450.0460.0470.0480.0490.0Gr(D)利賀川常時満水位N.W.L=411.000t=600t=100t=100設計洪水位D.W.L=437.000サーチャージ水位S.W.L=434.50034°37°46°Gr(D)取付け道路00.52.02.20 1002003004006001550017000111900流路工SL=25000護岸工(モルタル吹付工t=10cm)(鉄線蛇篭張工または盛土工)斜面対策工SL=93500簡易吹付法枠工(300×100-1300×1300枠内植生基材吹付t=5cm)79500斜面対策工SL=15000標準横断図dtGr(D)補強材(異形棒鋼,D25)L=3.5m,n=5,8段41°想定崩壊面t=300流路工SL=108000(モルタル吹付工t=10cm)斜面対策工SL=8000植生基材吹付t=5cm標準横断図36葉之内28北陸地方整備局利賀ダム工事事務所S=1:200事務所名会社名尺度図面番号図面名年月日工事名平成18年11月斜面対策(利賀湖面橋右岸側)松谷橋下部その2他工事モルタル吹付DL=425.0簡易吹付法枠工Aタイプ枠内:植生基材吹付t=5cmGrdtt=10cmGr60.0B付近簡易吹付法枠工Aタイプ枠内:植生基材吹付t=5cmGrGrdt断面図S=1:200(仮設モルタル吹付部t=10cm)(仮設モルタル吹付部t=10cm)(仮設モルタル吹付部t=10cm)斉藤・越飛・米倉経常建設共同企業体S=1:200\",\n" +
            "              \"page\": 27\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"集水桝1:200400.01:200410.0420.0430.0440.0450.0460.0470.0480.0490.0Gr(D)利賀川常時満水位N.W.L=411.000t=100t=100設計洪水位D.W.L=437.000サーチャージ水位S.W.L=434.50034°37°46°Gr(D)3490017000113100流路工SL=30000(モルタル吹付工t=10cm)61200流路工SL=78000(モルタル吹付工t=10cm+CF200法枠×2条)(モルタル吹付工t=10cm)AA流路工底面400.0410.0420.0430.0440.0450.0460.0470.0480.0490.0流路工構造図S=図示留意点1.流路工の通水断面は,「直径0.5mの半円形相当」以上とする。留意点2.流路工が屈曲する箇所など,攻撃斜面となる区間では,洗堀・浸食を受けないよう配慮する。留意点3.アンカーピンおよび補助ピンは,流路工が滑落することのないよう,適切に配置する。縦断図S=1:300横断図S=1:20吹付材(モルタル)配合規格工種水セメント比吹付法枠工セメント400kg材料(m3あたり)※吹付モルタル強度σ28=15N/mm2以上。※標準設計p36「吹付法枠工」による。45~60%モルタル吹付t=10cm補助アンカーピンD10×200mmアンカーピンD16×400mm2000500500ラス金網φ2 50×50B-B断面t=200200 200600吹付材σck≧15N/mm2型枠200×200用鉄筋D10D10×200mm補助アンカーピンD16×400mmアンカーピンφ2 50×50ラス金網A-A断面BBt=600流路工SL=25000護岸工SL=20800 (モルタル吹付工t=10cm)(鉄線蛇篭張工または盛土工)流路工SL=133000流路工構造図36葉之内29北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月斜面対策(利賀湖面橋右岸側)松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 28\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 29\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"平面図縮尺1:1500事務所北陸地方整備局事務所名利賀ダム工事斉藤・越飛・米倉経常建設共同企業体松谷橋下部その2他工事平面図平成年月日会社名縮尺工事名図面名11月18年図面番号S=1:1500舗装(押谷トンネル)36葉之内31\",\n" +
            "              \"page\": 30\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"舗装(押谷トンネル)拱頂縦断図(1)36葉之内32北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 31\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"舗装(押谷トンネル)拱頂縦断図(2)36葉之内33北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 32\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"標準断面図36葉之内34北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 33\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"平面図舗装(押谷トンネル)排水系統図36葉之内35北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 34\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"舗装(押谷トンネル)排水工詳細図36葉之内36北陸地方整備局利賀ダム工事事務所図示事務所名会社名尺度図面番号図面名年月日工事名平成18年11月松谷橋下部その2他工事斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 35\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その7)平成18年11月8葉之内1(参考図)橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 36\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その8)平成18年11月8葉之内2(参考図)橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 37\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"S=1:50北陸地方整備局利賀ダム工事事務所図面名会社名事務所名尺度年月日工事名A1橋台配筋図(その9)平成18年11月8葉之内3(参考図)橋梁下部(橋台工)松谷橋下部その2他工事図面番号斉藤・越飛・米倉経常建設共同企業体\",\n" +
            "              \"page\": 38\n" +
            "            },\n" +
            "            {\n" +
            "              \"content\": \"\",\n" +
            "              \"page\": 39\n" +
            "            }\n" +
            "          ]";
    @GetMapping("/data")
    public List<Hit<Data>> getData(@RequestParam(name = "data") String data) throws Exception {
        try{
            SearchResponse<Data> searchResponse = opensearchConfig.OpensearchInit().search(s -> s
                    .index("searchlogs")
                    .query(q -> q
                            .term(t -> t
                                    .field("message")
                                    .value(v -> v.stringValue(data))
                            )
                    ), Data.class);

            log.info(searchResponse.took());
            List<Hit<Data>> a = searchResponse.hits().hits().stream().toList();
            return searchResponse.hits().hits().stream().toList();
        }catch (Exception ignored) {
            return null;
        }
    }

    @PostMapping("/data")
    public String postData(@RequestParam(name = "data") String data) {
        try {

//            String jsonData = `{"data":data}`;
            logger.info(Log4j2Config.logstash(),data);
            return data;
        }catch (Exception ignored) {
            return null;
        }
    }

    @PostMapping("/data1")
    public String post1Data() {
        try {

//            String jsonData = `{"data":data}`;
            logger.info(Log4j2Config.logstash(),a);
            return a;
        }catch (Exception ignored) {
            return null;
        }
    }




}
